codewarlocks/stm32f7-Pedalboard/Projects/STM32746G-Discovery/Examples/BSP/MDK-ARM/STM32746G_DISCOVERY/Example/User/gui.c
#include <stdlib.h>
#include <stdio.h>
#include "stm32746g_discovery.h"
#include "stm32746g_discovery_lcd.h"
#include "stm32746g_discovery_ts.h"
#include "gui/gui.h"
#include "ex03/macros.h"
#include "main.h"
#include "string.h"
#include "gui/leds.h"
#include "gui/whaondas.h"

#include "gui/cartel.h"

//#include "gui/perilla35x35x25.h"
//#include "gui/perilla42x41x25.h"
//#include "gui/perilla52x52x25.h"
//#include "gui/eq_slider.h"

#include "gui/prototipos.h"
#include "gui/tremoloondas.h"
#include "gui/vibratoondas.h"

#define DELAY          0
#define OCTAVADOR      1
#define CHORUS         2
#define PHASER         3
#define WAH            4
#define REVERB         5
#define DISTORSION     6
#define FLANGER        7
#define TREMOLO        8
#define VIBRATO        9
#define EQ             10
#define RINGMOD        11
#define GRABAR         12
#define IZQUIERDA      0
#define MENU_1         14
#define MENU_2         15
#define MENU_3         16
#define DERECHA        1
#define HOME           2
#define IZQUIERDA_MENU 17
#define DERECHA_MENU   18

#define PERILLA        0
#define SLIDER         1
// private functions


extern PedalElement *Pedales[13];
static uint32_t color_mode_init = 0;

DMA2D_HandleTypeDef hDma2dHandler;

// externally defined structures & functions

LTDC_HandleTypeDef hLtdcHandler;

#if SCREEN_ENABLE
extern int seleccion_pedal, seleccion_menu;
extern int pedal_individual;
extern LinkElementMenu *Flecha_Menu_Izquierda, *Flecha_Menu_Derecha;

FIL perillas_ptr;
static uint8_t *Perillas_Buffer_35x35x25 = (uint8_t *)(PERILLA_35x35x25);
static uint8_t *Perillas_Buffer_42x41x25 = (uint8_t *)(PERILLA_42x41x25);
static uint8_t *Perillas_Buffer_52x52x25 = (uint8_t *)(PERILLA_52x52x25);
static uint8_t *Perillas_Buffer_eq_slider = (uint8_t *)(PERILLA_EQ_SLIDER);

//Varibales Perillas Spritesheet_slider
static SpriteSheet perilla3535;// = { .pixels = Perillas_Buffer_35x35x25,
//.spriteWidth = 35, .spriteHeight = 35, .numSprites = 25, .format =
//CM_ARGB8888};
static SpriteSheet perilla4241; //= { .pixels = Perillas_Buffer_42x41x25,
//.spriteWidth = 42, .spriteHeight = 41, .numSprites = 25, .format =
//CM_ARGB8888};
static SpriteSheet perilla5252;// = { .pixels = perilla52x52x25,
//.spriteWidth = 52, .spriteHeight = 52, .numSprites = 25, .format =
//CM_ARGB8888};//CM_RGB888
static SpriteSheet eq_slider; //= { .pixels = eq_slider_30,
//.spriteWidth = 30, .spriteHeight = 83, .numSprites = 26, .format =
//CM_ARGB8888};//CM_RGB888
static SpriteSheet whaonda = { .pixels      = whaondas,
                               .spriteWidth = 41,      .spriteHeight= 41, .numSprites = 6, .format =
                                   CM_ARGB8888 };//CM_RGB888
static SpriteSheet vibratoonda = { .pixels      = vibratoondas,
                                   .spriteWidth = 35,          .spriteHeight= 35, .numSprites = 4, .format =
                                       CM_ARGB8888 };//CM_RGB888
static SpriteSheet tremoloonda = { .pixels      = tremoloondas,
                                   .spriteWidth = 41,          .spriteHeight= 41, .numSprites = 4, .format =
                                       CM_ARGB8888 };//CM_RGB888

static uint8_t buffer_imagenes[196000] = { 0 }; //10816
static uint8_t colorModeStrides[5] = { 4, 3, 2, 2, 2 };

#endif /* if SCREEN_ENABLE */

void read_files_perillas(void) {
    f_open(&perillas_ptr, "/Perillas/35.bin", FA_READ);
    f_read(&perillas_ptr, Perillas_Buffer_35x35x25, 122500, NULL);
    f_close(&perillas_ptr);

    f_open(&perillas_ptr, "/Perillas/42.bin", FA_READ);
    f_read(&perillas_ptr, Perillas_Buffer_42x41x25, 172200, NULL);
    f_close(&perillas_ptr);

    f_open(&perillas_ptr, "/Perillas/52.bin", FA_READ);
    f_read(&perillas_ptr, Perillas_Buffer_52x52x25, 270400, NULL);
    f_close(&perillas_ptr);

    f_open(&perillas_ptr, "/Perillas/eq.bin", FA_READ);
    f_read(&perillas_ptr, Perillas_Buffer_eq_slider, 258960, NULL);
    f_close(&perillas_ptr);
}

void init_LL_ConvertLine_DMA2D(uint32_t color_mode) {
    HAL_DMA2D_DeInit(&hDma2dHandler);

    hDma2dHandler.Init.Mode = DMA2D_M2M_PFC;
    hDma2dHandler.Init.ColorMode = DMA2D_ARGB8888;
    hDma2dHandler.Init.OutputOffset = 0;

    hDma2dHandler.LayerCfg[1].AlphaMode = DMA2D_NO_MODIF_ALPHA;                 //
    hDma2dHandler.LayerCfg[1].InputAlpha = 0xFF;                //FF
    hDma2dHandler.LayerCfg[1].InputColorMode = color_mode;
    hDma2dHandler.LayerCfg[1].InputOffset = 0;
    hDma2dHandler.Instance = DMA2D;

    color_mode_init = color_mode;

    if (HAL_DMA2D_Init(&hDma2dHandler) == HAL_OK) {
        if (HAL_DMA2D_ConfigLayer(&hDma2dHandler, 1) == HAL_OK) {
        }
    }
}

void LL_ConvertLineToARGB8888(void *src, void *dst, uint32_t xstride, uint32_t color_mode) {
    if (color_mode != color_mode_init) {
        init_LL_ConvertLine_DMA2D(color_mode);
    }

    if (HAL_DMA2D_Start(&hDma2dHandler, (uint32_t)src, (uint32_t)dst, xstride,
                        1) == HAL_OK) {
        HAL_DMA2D_PollForTransfer(&hDma2dHandler, 10);
    }
}

// GUI element constructors
GUIElement * guiElement(uint8_t id, char *label, uint16_t x, uint16_t y,
                        SpriteSheet *sprite, GUICallback cb) {
    GUIElement *e = (GUIElement *)calloc(1, sizeof(GUIElement));

    e->id = id;
    e->x = x;
    e->y = y;
    e->width = sprite->spriteWidth;
    e->height = sprite->spriteHeight;
    e->sprite = sprite;
    e->label = label;
    e->callback = cb;
    e->state = GUI_OFF | GUI_DIRTY;
    return e;
}

#if SCREEN_ENABLE

// push button functions


// dial button functions

void handleDialButton(GUIElement *bt, GUITouchState *touch) {
    int16_t delta = 0;
    float newVal = 0;

    if (touch->touchDetected) {
        // touch detected...
        uint16_t x = touch->touchX[0];
        uint16_t y = touch->touchY[0];
        DialButtonState *db = (DialButtonState *)bt->userData;

        if (bt->state == GUI_HOVER) {
            if (db->orientacion == PERILLA) {
                delta = (x - db->startX);
                newVal = db->startValue + db->sensitivity * delta;
                db->value = CLAMP(newVal, 0.0f, 1.0f);
            } else if (db->orientacion == SLIDER) {
                delta = (y - db->startY);
                newVal = db->startValue + (db->sensitivity / 2) * delta;
                db->value = CLAMP(newVal, 0.0f, 1.0f);
            }

            bt->state = GUI_DIRTY | GUI_HOVER;

            if (bt->callback != NULL) {
                bt->callback(bt);
            }
        } else if (x >= bt->x && x < bt->x + bt->width && y >= bt->y && y < bt->y + bt->height) {
            bt->state = GUI_HOVER;
            db->startX = x;
            db->startY = y;
            db->startValue = db->value;
        }
    } else if (bt->state == GUI_HOVER) {
        bt->state = GUI_OFF | GUI_DIRTY;
    }
}

void renderDialButton(GUIElement *bt) {
    uint8_t id = 0;

    if (bt->state & GUI_DIRTY) {
        SpriteSheet *sprite = bt->sprite;
        DialButtonState *db = (DialButtonState *)bt->userData;

        if (db->orientacion == SLIDER) {
            if (Pedales[10]->push->push_state == GUI_ON || Pedales[10]->push->push_state == (GUI_OFF | GUI_HOVER)) {
                id = (uint8_t)(db->value * (float32_t)(12));
            } else if (Pedales[10]->push->push_state == GUI_OFF || Pedales[10]->push->push_state == (GUI_ON | GUI_HOVER)) {
                id = (uint8_t)13 + (db->value * (float32_t)(12));
            }
        } else {
            id = (uint8_t)(db->value * (float)(sprite->numSprites - 1));
        }

        drawSprite(bt->x, bt->y, id, sprite);
        bt->state &= ~((uint16_t)GUI_DIRTY);
    }
}

void drawSprite(uint16_t x, uint16_t y, uint8_t id, SpriteSheet *sprite) {
    uint32_t lcdWidth = BSP_LCD_GetXSize();
    uint32_t address = hLtdcHandler.LayerCfg[LTDC_ACTIVE_LAYER].FBStartAdress
        + (((lcdWidth * y) + x) << 2);
    uint16_t width = sprite->spriteWidth;
    uint16_t height = sprite->spriteHeight;
    uint32_t stride = colorModeStrides[sprite->format];

    memcpy(buffer_imagenes, (uint8_t *)&sprite->pixels[(id * width * height) * stride], width * height * stride);

    uint8_t *pixels = buffer_imagenes;

    stride *= width;
    lcdWidth <<= 2;

    while (--height) {
        LL_ConvertLineToARGB8888(pixels, (uint32_t *)address, width, CM_ARGB8888);
        address += lcdWidth;
        pixels += stride;
    }
}

void drawBitmapRaw(uint16_t x, uint16_t y, uint16_t width, uint16_t height,
                   uint8_t *pixels, uint32_t colorMode, uint8_t active_layer) {
    uint32_t lcdWidth = BSP_LCD_GetXSize();
    uint32_t address = hLtdcHandler.LayerCfg[active_layer].FBStartAdress
        + (((lcdWidth * y) + x) << 2);                //LTDC_ACTIVE_LAYER
    uint16_t stride = width * colorModeStrides[colorMode];

    lcdWidth <<= 2;

    while (--height) {
        LL_ConvertLineToARGB8888(pixels, (uint32_t *)address, width, colorMode);
        address += lcdWidth;
        pixels += stride;
    }
}

void guiForceRedraw(GUI *gui) {
    for (uint8_t i = 0; i < gui->numItems; i++) {
        gui->items[i]->state |= GUI_DIRTY;
    }
}

void guiUpdate(PerillaElement *gui, GUITouchState *touch) {
    for (uint8_t i = 0; i < gui->numItems; i++) {
        GUIElement *e = gui->perillas[i];
        e->handler(e, touch);
        e->render(e);
    }
}

void guiUpdateTouch(TS_StateTypeDef *raw, GUITouchState *touch) {
    touch->touchDetected = raw->touchDetected;
    touch->touchX[0] = raw->touchX[0];
    touch->touchY[0] = raw->touchY[0];
}

//Escritas por nosotros

void linkRequestHandlers_pedal_individual(PedalElement *bt, GUITouchState *touch) {
    bt->botones->flecha_derecha->handler(bt, touch);
    bt->botones->flecha_izquierda->handler(bt, touch);
    bt->botones->home->handler(bt, touch);
}

void linkRequestHandler_menu(PedalElement **bt, GUITouchState *touch) {
    if (seleccion_menu == MENU_1) {
        for (uint8_t i = 0; i < 6; i++) {
            bt[i]->link->handler(bt[i], touch);
        }
    } else if (seleccion_menu == MENU_2) {
        for (uint8_t i = 6; i < 12; i++) {
            bt[i]->link->handler(bt[i], touch);
        }
    } else if (seleccion_menu == MENU_3) {
    }
}

void linkRequestHandler_Flechas_Menu(LinkElementMenu *bt, GUITouchState *touch) {
    bt->handler(bt, touch);
}

void PushRequestHandler_menu(PedalElement **bt, GUITouchState *touch) {
    if (seleccion_menu == MENU_1) {
        for (uint8_t i = 0; i < 6; i++) {
            bt[i]->push->push_menu->handler(bt[i], touch);
        }
    } else if (seleccion_menu == MENU_2) {
        for (uint8_t i = 6; i < 12; i++) {
            bt[i]->push->push_menu->handler(bt[i], touch);
        }
    } else if (seleccion_menu == MENU_3 && bt[GRABAR]->push->push_state != GUI_ON) {
        bt[GRABAR]->push->push_menu->handler(bt[GRABAR], touch);
    }
}

GUIElement * guiDialButton(uint8_t id, char *label, uint16_t x, uint16_t y,
                           float val, float sens, uint8_t orientacion, SpriteSheet *sprite, GUICallback cb) {
    GUIElement *e = guiElement(id, label, x, y, sprite, cb);
    DialButtonState *db = (DialButtonState *)calloc(1, sizeof(DialButtonState));

