codewarlocks/stm32f7-Pedalboard/Projects/STM32746G-Discovery/Examples/BSP/MDK-ARM/STM32746G_DISCOVERY/Example/User/gui.c
    e->handler = handleDialButton;
    e->render = renderDialButton;
    e->userData = db;
    db->value = val;
    db->sensitivity = sens;
    db->orientacion = orientacion;
    return e;
}

LinkElement * initPushLink(uint8_t nombre, uint16_t x, uint16_t y, uint16_t width, uint16_t height, GUICallbackLink cb, LinkHandler han) {
    LinkElement *e = calloc(1, sizeof(LinkElement));

    e->nombre = nombre;
    e->x = x;
    e->y = y;
    e->width = width;
    e->height = height;
    e->callback = cb;
    e->handler = han;
    return e;
}

LinkElementMenu * initPushLinkMenu(uint8_t nombre, uint16_t x, uint16_t y, uint16_t width, uint16_t height, GUICallbackLinkMenu cb, LinkHandlerMenu han) {
    LinkElementMenu *e = calloc(1, sizeof(LinkElementMenu));

    e->nombre = nombre;
    e->x = x;
    e->y = y;
    e->width = width;
    e->height = height;
    e->callback = cb;
    e->handler = han;
    return e;
}

PerillaElement * initPerilla(uint8_t num) {
    PerillaElement *gui = (PerillaElement *)calloc(1, sizeof(PerillaElement));

    gui->perillas = (GUIElement **)calloc(num, sizeof(GUIElement *));
    gui->numItems = num;
    return gui;
}

void PedalForceRedraw(PedalElement *gui) {
    for (uint8_t i = 0; i < gui->perilla->numItems; i++) {
        gui->perilla->perillas[i]->state |= GUI_DIRTY;
    }

    if (gui->push->push_state == GUI_ON || gui->push->push_state == GUI_OFF) {
        gui->push->push_state |= GUI_HOVER;
        gui->push->push_state ^= GUI_ONOFF_MASK;
    }
}

void MenuForceRedraw(void) {
    if (seleccion_menu == MENU_1) {
        for (int aux_i = 0; aux_i < 6; aux_i++) {
            if (Pedales[aux_i]->push->push_state == GUI_ON || Pedales[aux_i]->push->push_state == GUI_OFF) {
                Pedales[aux_i]->push->push_state |= GUI_HOVER;
                Pedales[aux_i]->push->push_state ^= GUI_ONOFF_MASK;
            }
        }
    } else if (seleccion_menu == MENU_2) {
        for (int aux_i = 6; aux_i < 12; aux_i++) {
            if (Pedales[aux_i]->push->push_state == GUI_ON || Pedales[aux_i]->push->push_state == GUI_OFF) {
                Pedales[aux_i]->push->push_state |= GUI_HOVER;
                Pedales[aux_i]->push->push_state ^= GUI_ONOFF_MASK;
            }
        }
    } else if (seleccion_menu == MENU_3) {
        if (Pedales[GRABAR]->push->push_state == GUI_ON || Pedales[GRABAR]->push->push_state == GUI_OFF) {
            Pedales[GRABAR]->push->push_state |= GUI_HOVER;
            Pedales[GRABAR]->push->push_state ^= GUI_ONOFF_MASK;
        }
    }
}

//Handles
void handlePushMenuButton(PedalElement *bt, GUITouchState *touch) {
    if (touch->touchDetected) {
        // touch detected...
        uint16_t x = touch->touchX[0];
        uint16_t y = touch->touchY[0];

        if (x >= bt->push->push_menu->x && x < bt->push->push_menu->x + bt->push->push_menu->width &&
            y >= bt->push->push_menu->y && y < bt->push->push_menu->y + bt->push->push_menu->height) {
            switch (bt->push->push_state) {
                case GUI_OFF:
                    bt->push->push_state |= GUI_HOVER | GUI_DIRTY;
                    break;

                case GUI_ON:
                    bt->push->push_state |= GUI_HOVER | GUI_DIRTY;
                    break;

                default:
                    break;
            }
        }
    } else if (bt->push->push_state & GUI_HOVER) {
        // clear hover flag
        bt->push->push_state &= ~((uint16_t)GUI_HOVER);
        // mark dirty (force redraw)
        bt->push->push_state |= GUI_DIRTY;
        // invert on/off bitmask
        bt->push->push_state ^= GUI_ONOFF_MASK;

        if (bt->push->push_menu->callback != NULL) {
            bt->push->push_menu->callback(bt);
        }
    }
}

void handlePushIndividualButton(PedalElement *bt, GUITouchState *touch) {
    if (touch->touchDetected) {
        // touch detected...
        uint16_t x = touch->touchX[0];
        uint16_t y = touch->touchY[0];

        if (x >= bt->push->push_indiv->x && x < bt->push->push_indiv->x + bt->push->push_indiv->width && y >= bt->push->push_indiv->y && y < bt->push->push_indiv->y + bt->push->push_indiv->height) {
            switch (bt->push->push_state) {
                case GUI_OFF:
                    bt->push->push_state |= GUI_HOVER;
                    break;

                case GUI_ON:
                    bt->push->push_state |= GUI_HOVER;
                    break;

                default:
                    break;
            }
        }
    } else if (bt->push->push_state & GUI_HOVER) {
        // clear hover flag
        bt->push->push_state &= ~((uint16_t)GUI_HOVER);
        // mark dirty (force redraw)
        bt->push->push_state |= GUI_DIRTY;
        // invert on/off bitmask
        bt->push->push_state ^= GUI_ONOFF_MASK;

        if (bt->push->push_indiv->callback != NULL) {
            bt->push->push_indiv->callback(bt);
        }
    }
}

void handleLinkButton(PedalElement *bt, GUITouchState *touch) {
    if (touch->touchDetected) {
        // touch detected...
        uint16_t x = touch->touchX[0];
        uint16_t y = touch->touchY[0];

        if (x >= bt->link->x && x < bt->link->x + bt->link->width && y >= bt->link->y && y < bt->link->y + bt->link->height) {
            bt->link->callback(bt);
        }
    }
}

void handleDerechaButtonPedal(PedalElement *bt, GUITouchState *touch) {
    if (touch->touchDetected) {
        // touch detected...
        uint16_t x = touch->touchX[0];
        uint16_t y = touch->touchY[0];

        if (x >= bt->botones->flecha_derecha->x && x < bt->botones->flecha_derecha->x + bt->botones->flecha_derecha->width &&
            y >= bt->botones->flecha_derecha->y && y < bt->botones->flecha_derecha->y + bt->botones->flecha_derecha->height) {
            bt->botones->flecha_derecha->callback(bt);
        }
    }
}

void handleIzquierdaButtonPedal(PedalElement *bt, GUITouchState *touch) {
    if (touch->touchDetected) {
        // touch detected...
        uint16_t x = touch->touchX[0];
        uint16_t y = touch->touchY[0];

        if (x >= bt->botones->flecha_izquierda->x && x < bt->botones->flecha_izquierda->x + bt->botones->flecha_izquierda->width &&
            y >= bt->botones->flecha_izquierda->y && y < bt->botones->flecha_izquierda->y + bt->botones->flecha_izquierda->height) {
            bt->botones->flecha_izquierda->callback(bt);
        }
    }
}

