codewarlocks/stm32f7-Pedalboard/Projects/STM32746G-Discovery/Examples/BSP/MDK-ARM/STM32746G_DISCOVERY/Example/User/gui.c
void handleHomeButtonPedal(PedalElement *bt, GUITouchState *touch) {
    if (touch->touchDetected) {
        // touch detected...
        uint16_t x = touch->touchX[0];
        uint16_t y = touch->touchY[0];

        if (x >= bt->botones->home->x && x < bt->botones->home->x + bt->botones->home->width &&
            y >= bt->botones->home->y && y < bt->botones->home->y + bt->botones->home->height) {
            bt->botones->home->callback(bt);
        }
    }
}

//Menu Link Izq y Der
void handleDerechaButtonMenu(LinkElementMenu *bt, GUITouchState *touch) {
    if (touch->touchDetected) {
        // touch detected...
        uint16_t x = touch->touchX[0];
        uint16_t y = touch->touchY[0];

        if (x >= bt->x && x < bt->x + bt->width && y >= bt->y && y < bt->y + bt->height) {
            bt->callback(bt);
        }
    }
}

void handleIzquierdaButtonMenu(LinkElementMenu *bt, GUITouchState *touch) {
    if (touch->touchDetected) {
        // touch detected...
        uint16_t x = touch->touchX[0];
        uint16_t y = touch->touchY[0];

        if (x >= bt->x && x < bt->x + bt->width && y >= bt->y && y < bt->y + bt->height) {
            bt->callback(bt);
        }
    }
}

//Callbacks
void LinkCallback(PedalElement *e) {
    switch (e->link->nombre) {
        case DELAY:
            DrawScreen(DELAY);
            pedal_individual = 1;
            seleccion_pedal = DELAY;
            break;

        case OCTAVADOR:
            DrawScreen(OCTAVADOR);
            pedal_individual = 1;
            seleccion_pedal = OCTAVADOR;
            break;

        case CHORUS:
            DrawScreen(CHORUS);
            pedal_individual = 1;
            seleccion_pedal = CHORUS;
            break;

        case PHASER:
            DrawScreen(PHASER);
            seleccion_pedal = PHASER;
            pedal_individual = 1;
            break;

        case WAH:
            DrawScreen(WAH);
            pedal_individual = 1;
            seleccion_pedal = WAH;
            break;

        case REVERB:
            DrawScreen(REVERB);
            pedal_individual = 1;
            seleccion_pedal = REVERB;
            break;

        case DISTORSION:
            DrawScreen(DISTORSION);
            pedal_individual = 1;
            seleccion_pedal = DISTORSION;
            break;

        case FLANGER:
            DrawScreen(FLANGER);
            pedal_individual = 1;
            seleccion_pedal = FLANGER;
            break;

        case TREMOLO:
            DrawScreen(TREMOLO);
            pedal_individual = 1;
            seleccion_pedal = TREMOLO;
            break;

        case VIBRATO:
            DrawScreen(VIBRATO);
            seleccion_pedal = VIBRATO;
            pedal_individual = 1;
            break;

        case EQ:
            DrawScreen(EQ);
            pedal_individual = 1;
            seleccion_pedal = EQ;
            break;

        case RINGMOD:
            DrawScreen(RINGMOD);
            pedal_individual = 1;
            seleccion_pedal = RINGMOD;
            break;
    }
    PedalForceRedraw(e);
}

void PushCallback(PedalElement *e) {
    if (e->push->push_state & GUI_DIRTY) {
        uint8_t states = e->push->push_state & GUI_ONOFF_MASK;

        if (pedal_individual == 0) {
            if (states == GUI_ON) {
                switch (e->push->push_menu->nombre) {
                    case DELAY:
                        memcpy(buffer_imagenes, (uint8_t *)ledprendidodelaymenu, 100);
                        drawBitmapRaw(85, 96, 5, 5, buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case OCTAVADOR:
                        memcpy(buffer_imagenes, (uint8_t *)ledprendidooctavadormenu, 144);
                        drawBitmapRaw(237, 78, 6, 6, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case CHORUS:
                        memcpy(buffer_imagenes, (uint8_t *)ledprendidochorusmenu, 36);
                        drawBitmapRaw(375, 18, 3, 3, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case PHASER:
                        memcpy(buffer_imagenes, (uint8_t *)ledprendidophasermenu, 120);
                        drawBitmapRaw(103, 210, 5, 6, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case WAH:
                        memcpy(buffer_imagenes, (uint8_t *)ledprendidowahmenu, 224);
                        drawBitmapRaw(236, 209, 8, 7, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case REVERB:
                        memcpy(buffer_imagenes, (uint8_t *)ledprendidoreverbmenu, 224);
                        drawBitmapRaw(375, 211, 5, 5, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case DISTORSION:
                        memcpy(buffer_imagenes, (uint8_t *)ledprendidodistorsionmenu, 100);
                        drawBitmapRaw(80, 95, 5, 5, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case FLANGER:
                        memcpy(buffer_imagenes, (uint8_t *)ledprendidoflangermenu, 144);
                        drawBitmapRaw(237, 65, 6, 6, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case TREMOLO:
                        memcpy(buffer_imagenes, (uint8_t *)ledprendidotremolomenu, 256);
                        drawBitmapRaw(390, 22, 8, 8, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case VIBRATO:
                        memcpy(buffer_imagenes, (uint8_t *)ledprendidovibratomenu, 100);
                        drawBitmapRaw(80, 232, 5, 5, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case EQ:
                        memcpy(buffer_imagenes, (uint8_t *)ledprendidoeqmenu, 84);
                        drawBitmapRaw(190, 190, 3, 7, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        drawBitmapRaw(209, 190, 3, 7, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        drawBitmapRaw(228, 190, 3, 7, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        drawBitmapRaw(247, 190, 3, 7, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        drawBitmapRaw(267, 190, 3, 7, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        drawBitmapRaw(286, 190, 3, 7, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case RINGMOD:
                        memcpy(buffer_imagenes, (uint8_t *)ledprendidoringmodmenu, 144);
                        drawBitmapRaw(373, 241, 6, 6, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case GRABAR:
                        memcpy(buffer_imagenes, (uint8_t *)cartel, 196000);
                        drawBitmapRaw(65, 66, 350, 140, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;
                }
            } else {
                switch (e->push->push_menu->nombre) {
                    case DELAY:
                        memcpy(buffer_imagenes, (uint8_t *)ledapagadodelaymenu, 100);
                        drawBitmapRaw(85, 96, 5, 5, buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case OCTAVADOR:
                        memcpy(buffer_imagenes, (uint8_t *)ledapagadooctavadormenu, 144);
                        drawBitmapRaw(237, 78, 6, 6, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case CHORUS:
                        memcpy(buffer_imagenes, (uint8_t *)ledapagadochorusmenu, 36);
                        drawBitmapRaw(375, 18, 3, 3, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case PHASER:
                        memcpy(buffer_imagenes, (uint8_t *)ledapagadophasermenu, 120);
                        drawBitmapRaw(103, 210, 5, 6, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case WAH:
                        memcpy(buffer_imagenes, (uint8_t *)ledapagadowahmenu, 100);
                        drawBitmapRaw(236, 209, 8, 7, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case REVERB:
                        memcpy(buffer_imagenes, (uint8_t *)ledapagadoreverbmenu, 100);
                        drawBitmapRaw(375, 211, 5, 5, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

