codewarlocks/stm32f7-Pedalboard/Projects/STM32746G-Discovery/Examples/BSP/MDK-ARM/STM32746G_DISCOVERY/Example/User/gui.c
                    case DISTORSION:
                        memcpy(buffer_imagenes, (uint8_t *)ledapagadodistorsionmenu, 100);
                        drawBitmapRaw(80, 95, 5, 5, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case FLANGER:
                        memcpy(buffer_imagenes, (uint8_t *)ledapagadoflangermenu, 144);
                        drawBitmapRaw(237, 65, 6, 6, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case TREMOLO:
                        memcpy(buffer_imagenes, (uint8_t *)ledapagadotremolomenu, 256);
                        drawBitmapRaw(390, 22, 8, 8, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case VIBRATO:
                        memcpy(buffer_imagenes, (uint8_t *)ledapagadovibratomenu, 100);
                        drawBitmapRaw(80, 232, 5, 5, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case EQ:
                        memcpy(buffer_imagenes, (uint8_t *)ledapagadoeqmenu, 84);
                        drawBitmapRaw(190, 190, 3, 7, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        drawBitmapRaw(209, 190, 3, 7, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        drawBitmapRaw(228, 190, 3, 7, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        drawBitmapRaw(247, 190, 3, 7, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        drawBitmapRaw(267, 190, 3, 7, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        drawBitmapRaw(286, 190, 3, 7, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case RINGMOD:
                        memcpy(buffer_imagenes, (uint8_t *)ledapagadoringmodmenu, 144);
                        drawBitmapRaw(373, 241, 6, 6, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case GRABAR:
//									  DrawScreen(GRABAR);
                        memset(buffer_imagenes, 0, 196000);
                        memset(buffer_imagenes, 0, 196000);
                        drawBitmapRaw(65, 66, 350, 140, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;
                }
            }
        } else {
            if (states == GUI_ON) {
                switch (e->push->push_indiv->nombre) {
                    case DELAY:
                        memcpy(buffer_imagenes, (uint8_t *)ledprendidodelaypedal, 360);
                        drawBitmapRaw(196, 200, 10, 9, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case OCTAVADOR:
                        memcpy(buffer_imagenes, (uint8_t *)ledprendidooctavadorpedal, 960);
                        drawBitmapRaw(233, 159, 15, 16, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case CHORUS:
                        memcpy(buffer_imagenes, (uint8_t *)ledprendidochoruspedal, 168);
                        drawBitmapRaw(236, 23, 7, 6, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case PHASER:
                        memcpy(buffer_imagenes, (uint8_t *)ledprendidophaserpedal, 576);
                        drawBitmapRaw(235, 150, 12, 12, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case WAH:
                        memcpy(buffer_imagenes, (uint8_t *)ledprendidowahpedal, 1368);
                        drawBitmapRaw(230, 148, 19, 18, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case REVERB:
                        memcpy(buffer_imagenes, (uint8_t *)ledprendidoreverbpedal, 676);
                        drawBitmapRaw(236, 151, 13, 13, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case DISTORSION:
                        memcpy(buffer_imagenes, (uint8_t *)ledprendidodistorsionpedal, 324);
                        drawBitmapRaw(198, 198, 9, 9, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case FLANGER:
                        memcpy(buffer_imagenes, (uint8_t *)ledprendidoflangerpedal, 676);
                        drawBitmapRaw(234, 130, 13, 13, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case TREMOLO:
                        memcpy(buffer_imagenes, (uint8_t *)ledprendidotremolopedal, 2208);
                        drawBitmapRaw(228, 29, 23, 24, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case VIBRATO:
                        memcpy(buffer_imagenes, (uint8_t *)ledprendidovibratopedal, 440);
                        drawBitmapRaw(196, 200, 11, 10, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case EQ:
                        PedalForceRedraw(e);
                        break;

                    case RINGMOD:
                        memcpy(buffer_imagenes, (uint8_t *)ledprendidoringmodpedal, 400);
                        drawBitmapRaw(195, 222, 10, 10, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;
                }
            } else {
                switch (e->push->push_indiv->nombre) {
                    case DELAY:
                        memcpy(buffer_imagenes, (uint8_t *)ledapagadodelaypedal, 360);
                        drawBitmapRaw(196, 200, 10, 9, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case OCTAVADOR:
                        memcpy(buffer_imagenes, (uint8_t *)ledapagadooctavadorpedal, 960);
                        drawBitmapRaw(233, 159, 15, 16, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case CHORUS:
                        memcpy(buffer_imagenes, (uint8_t *)ledapagadochoruspedal, 168);
                        drawBitmapRaw(236, 23, 7, 6, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case PHASER:
                        memcpy(buffer_imagenes, (uint8_t *)ledapagadophaserpedal, 576);
                        drawBitmapRaw(235, 150, 12, 12, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case WAH:
                        memcpy(buffer_imagenes, (uint8_t *)ledapagadowahpedal, 1368);
                        drawBitmapRaw(230, 148, 19, 18, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case REVERB:
                        memcpy(buffer_imagenes, (uint8_t *)ledapagadoreverbpedal, 676);
                        drawBitmapRaw(236, 151, 13, 13, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

