codewarlocks/stm32f7-Pedalboard/Projects/STM32746G-Discovery/Examples/BSP/MDK-ARM/STM32746G_DISCOVERY/Example/User/gui.c
                    case DISTORSION:
                        memcpy(buffer_imagenes, (uint8_t *)ledapagadodistorsionpedal, 324);
                        drawBitmapRaw(198, 198, 9, 9, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case FLANGER:
                        memcpy(buffer_imagenes, (uint8_t *)ledapagadoflangerpedal, 676);
                        drawBitmapRaw(234, 130, 13, 13, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case TREMOLO:
                        memcpy(buffer_imagenes, (uint8_t *)ledapagadotremolopedal, 2208);
                        drawBitmapRaw(228, 29, 23, 24, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case VIBRATO:
                        memcpy(buffer_imagenes, (uint8_t *)ledapagadovibratopedal, 440);
                        drawBitmapRaw(196, 200, 11, 10, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;

                    case EQ:
                        PedalForceRedraw(e);
                        break;

                    case RINGMOD:
                        memcpy(buffer_imagenes, (uint8_t *)ledapagadoringmodpedal, 400);
                        drawBitmapRaw(195, 222, 10, 10, (uint8_t *)buffer_imagenes, CM_ARGB8888, 1);
                        break;
                }
            }
        }

        e->push->push_state &= ~((uint16_t)GUI_DIRTY);
    }
}

void LinkDerechaCallbackPedal(PedalElement *e) {
    seleccion_pedal++;

    if (seleccion_pedal >= 0 && seleccion_pedal < 6) {
        seleccion_menu = MENU_1;
        DrawScreen(seleccion_pedal);
        PedalForceRedraw(Pedales[seleccion_pedal]);
    } else if (seleccion_pedal >= 6 && seleccion_pedal < 12) {
        seleccion_menu = MENU_2;
        DrawScreen(seleccion_pedal);
        PedalForceRedraw(Pedales[seleccion_pedal]);
    } else if (seleccion_pedal == 12) {
        seleccion_menu = MENU_1;
        seleccion_pedal = 0;
        DrawScreen(seleccion_pedal);
        PedalForceRedraw(Pedales[seleccion_pedal]);
    }
}

void LinkIzquierdaCallbackPedal(PedalElement *e) {
    seleccion_pedal--;

    if (seleccion_pedal >= 0 && seleccion_pedal < 6) {
        seleccion_menu = MENU_1;
        DrawScreen(seleccion_pedal);
        PedalForceRedraw(Pedales[seleccion_pedal]);
    } else if (seleccion_pedal >= 6 && seleccion_pedal < 12) {
        seleccion_menu = MENU_2;
        DrawScreen(seleccion_pedal);
        PedalForceRedraw(Pedales[seleccion_pedal]);
    } else if (seleccion_pedal == -1) {
        seleccion_menu = MENU_2;
        seleccion_pedal = 11;
        DrawScreen(seleccion_pedal);
        PedalForceRedraw(Pedales[seleccion_pedal]);
    }
}

void LinkHomeCallbackPedal(PedalElement *e) {
    if (seleccion_menu == MENU_1) {
        pedal_individual = 0;
        DrawScreen(MENU_1);
        MenuForceRedraw();
        seleccion_pedal = 20;
    } else {
        pedal_individual = 0;
        DrawScreen(MENU_2);
        MenuForceRedraw();
        seleccion_pedal = 20;
    }
}

void LinkDerechaCallbackMenu(LinkElementMenu *e) {
    if (seleccion_menu == MENU_1) {
        seleccion_menu = MENU_2;
        DrawScreen(MENU_2);
    } else if (seleccion_menu == MENU_2) {
        seleccion_menu = MENU_3;
        DrawScreen(MENU_3);
    }

    MenuForceRedraw();
}

void LinkIzquierdaCallbackMenu(LinkElementMenu *e) {
    if (seleccion_menu == MENU_2) {
        seleccion_menu = MENU_1;
        DrawScreen(MENU_1);
    } else if (seleccion_menu == MENU_3) {
        seleccion_menu = MENU_2;
        DrawScreen(MENU_2);
    }

    MenuForceRedraw();
}

#endif /* if SCREEN_ENABLE */

GUI * initGUI(uint8_t num, sFONT *font, uint32_t bgCol, uint32_t textCol) {
    GUI *gui = (GUI *)calloc(1, sizeof(GUI));

    gui->items = (GUIElement **)calloc(num, sizeof(GUIElement *));
    gui->numItems = num;
    gui->font = font;
    gui->bgColor = bgCol;
    gui->textColor = textCol;
    return gui;
}

void initPedals() {
    // = { .pixels = Perillas_Buffer_35x35x25,
    //.spriteWidth = 35, .spriteHeight = 35, .numSprites = 25, .format =
    //CM_ARGB8888};//CM_RGB888
    perilla3535.format = CM_ARGB8888;
    perilla3535.numSprites = 25;
    perilla3535.pixels = Perillas_Buffer_35x35x25;
    perilla3535.spriteHeight = 35;
    perilla3535.spriteWidth = 35;

    //= { .pixels = Perillas_Buffer_42x41x25,
    //.spriteWidth = 42, .spriteHeight = 41, .numSprites = 25, .format =
    //CM_ARGB8888};
    perilla4241.format = CM_ARGB8888;
    perilla4241.numSprites = 25;
    perilla4241.pixels = Perillas_Buffer_42x41x25;
    perilla4241.spriteHeight = 41;
    perilla4241.spriteWidth = 42;

    // = { .pixels = perilla52x52x25,
    //.spriteWidth = 52, .spriteHeight = 52, .numSprites = 25, .format =
    //CM_ARGB8888};//CM_RGB888
    perilla5252.format = CM_ARGB8888;
    perilla5252.numSprites = 25;
    perilla5252.pixels = Perillas_Buffer_52x52x25;
    perilla5252.spriteHeight = 52;
    perilla5252.spriteWidth = 52;

    //= { .pixels = eq_slider_30,
    //.spriteWidth = 30, .spriteHeight = 83, .numSprites = 26, .format =
    //CM_ARGB8888};//CM_RGB888
    eq_slider.format = CM_ARGB8888;
    eq_slider.numSprites = 26;
    eq_slider.pixels = Perillas_Buffer_eq_slider;
    eq_slider.spriteHeight = 83;
    eq_slider.spriteWidth = 30;

                #if SCREEN_ENABLE
    //Inicializo las perillas Pantalla1
    //Delay
    Pedales[0] = (PedalElement *)calloc(1, sizeof(PedalElement));
    Pedales[0]->perilla = initPerilla(3);
    Pedales[0]->perilla->perillas[0] = guiDialButton(0, "", 174, 36, 0.0f, 0.045f, PERILLA, &perilla5252, delayFeedback);
    Pedales[0]->perilla->perillas[1] = guiDialButton(1, "", 253, 36, 0.400f, 0.045f, PERILLA, &perilla5252, delayTime);
    Pedales[0]->perilla->perillas[2] = guiDialButton(2, "", 220, 82, 0.5f, 0.045f, PERILLA, &perilla4241, delayLevel);
    //Octavador
    Pedales[1] = (PedalElement *)calloc(1, sizeof(PedalElement));
    Pedales[1]->perilla = initPerilla(1);
    Pedales[1]->perilla->perillas[0] = guiDialButton(8, "", 0, 0, 0.0f, 0.045f, PERILLA, &perilla5252, NULL);;
    //Chorus
    Pedales[2] = (PedalElement *)calloc(1, sizeof(PedalElement));
    Pedales[2]->perilla = initPerilla(2);
    Pedales[2]->perilla->perillas[0] = guiDialButton(0, "", 187, 22, 0.6f, 0.045f, PERILLA, &perilla4241, chorusRate);
    Pedales[2]->perilla->perillas[1] = guiDialButton(1, "", 250, 22, 0.367f, 0.045f, PERILLA, &perilla4241, chorusDepth);
    //Phaser
    Pedales[3] = (PedalElement *)calloc(1, sizeof(PedalElement));
    Pedales[3]->perilla = initPerilla(1);
    Pedales[3]->perilla->perillas[0] = guiDialButton(0, "", 214, 27, 0.667f, 0.045f, PERILLA, &perilla5252, phaserRate);
    //Autowah
    Pedales[4] = (PedalElement *)calloc(1, sizeof(PedalElement));
    Pedales[4]->perilla = initPerilla(4);
    Pedales[4]->perilla->perillas[0] = guiDialButton(0, "", 119, 41, 0.43f, 0.045f, PERILLA, &perilla4241, autowahDepth);
    Pedales[4]->perilla->perillas[1] = guiDialButton(1, "", 186, 41, 0.33f, 0.045f, PERILLA, &perilla4241, autowahRate);
    Pedales[4]->perilla->perillas[2] = guiDialButton(2, "", 251, 41, 0.6f, 0.045f, PERILLA, &perilla4241, autowahVolume);
    Pedales[4]->perilla->perillas[3] = guiDialButton(3, "", 319, 41, 0.9f, 0.045f, PERILLA, &whaonda, autowahMod);
    //Reverb
    Pedales[5] = (PedalElement *)calloc(1, sizeof(PedalElement));
    Pedales[5]->perilla = initPerilla(2);
    Pedales[5]->perilla->perillas[0] = guiDialButton(0, "", 191, 47, 0.5f, 0.045f, PERILLA, &perilla4241, reverbDecay);
    Pedales[5]->perilla->perillas[1] = guiDialButton(1, "", 253, 47, 0.4f, 0.045f, PERILLA, &perilla4241, reverbMix);

