codewarlocks/stm32f7-Pedalboard/Projects/STM32746G-Discovery/Examples/BSP/MDK-ARM/STM32746G_DISCOVERY/Example/User/gui.c
    //Inicializo las perillas Pantalla2
    //Distorsion
    Pedales[6] = (PedalElement *)calloc(1, sizeof(PedalElement));
    Pedales[6]->perilla = initPerilla(2);
    Pedales[6]->perilla->perillas[0] = guiDialButton(0, "", 179, 26, 0.61f, 0.045f, PERILLA, &perilla5252, distorsionGain);
    Pedales[6]->perilla->perillas[1] = guiDialButton(1, "", 249, 26, 0.5f, 0.045f, PERILLA, &perilla5252, distorsionBlend);
    //Flanger
    Pedales[7] = (PedalElement *)calloc(1, sizeof(PedalElement));
    Pedales[7]->perilla = initPerilla(4);
    Pedales[7]->perilla->perillas[0] = guiDialButton(0, "", 116, 55, 0.0f, 0.045f, PERILLA, &perilla5252, flangerManual);
    Pedales[7]->perilla->perillas[1] = guiDialButton(1, "", 182, 55, 0.57f, 0.045f, PERILLA, &perilla5252, flangerDepth);
    Pedales[7]->perilla->perillas[2] = guiDialButton(2, "", 246, 55, 0.2f, 0.045f, PERILLA, &perilla5252, flangerRate);
    Pedales[7]->perilla->perillas[3] = guiDialButton(3, "", 311, 55, 0.81f, 0.045f, PERILLA, &perilla5252, flangerFeedback);
    //Tremolo
    Pedales[8] = (PedalElement *)calloc(1, sizeof(PedalElement));
    Pedales[8]->perilla = initPerilla(3);
    Pedales[8]->perilla->perillas[0] = guiDialButton(0, "", 167, 40, 0.67f, 0.045f, PERILLA, &perilla4241, tremoloDepth);
    Pedales[8]->perilla->perillas[1] = guiDialButton(1, "", 220, 66, 0.2f, 0.045f, PERILLA, &tremoloonda, tremoloMod);
    Pedales[8]->perilla->perillas[2] = guiDialButton(2, "", 269, 40, 0.5f, 0.045f, PERILLA, &perilla4241, tremoloRate);
    //Vibrato
    Pedales[9] = (PedalElement *)calloc(1, sizeof(PedalElement));
    Pedales[9]->perilla = initPerilla(3);
    Pedales[9]->perilla->perillas[0] = guiDialButton(0, "", 180, 43, 0.6f, 0.045f, PERILLA, &perilla4241, vibratoRate);
    Pedales[9]->perilla->perillas[1] = guiDialButton(1, "", 257, 43, 0.41f, 0.045f, PERILLA, &perilla4241, vibratoDepth);
    Pedales[9]->perilla->perillas[2] = guiDialButton(2, "", 223, 86, 1.0f, 0.045f, PERILLA, &vibratoonda, vibratoMod);
    //EQ
    Pedales[10] = (PedalElement *)calloc(1, sizeof(PedalElement));
    Pedales[10]->perilla = initPerilla(6);
    Pedales[10]->perilla->perillas[0] = guiDialButton(0, "", 111, 97, 0.5f, 0.045f, SLIDER, &eq_slider, eqGain0);
    Pedales[10]->perilla->perillas[1] = guiDialButton(1, "", 156, 97, 0.5f, 0.045f, SLIDER, &eq_slider, eqGain1);
    Pedales[10]->perilla->perillas[2] = guiDialButton(2, "", 201, 97, 0.5f, 0.045f, SLIDER, &eq_slider, eqGain2);
    Pedales[10]->perilla->perillas[3] = guiDialButton(3, "", 246, 97, 0.5f, 0.045f, SLIDER, &eq_slider, eqGain3);
    Pedales[10]->perilla->perillas[4] = guiDialButton(4, "", 291, 97, 0.5f, 0.045f, SLIDER, &eq_slider, eqGain4);
    Pedales[10]->perilla->perillas[5] = guiDialButton(5, "", 336, 97, 0.5f, 0.045f, SLIDER, &eq_slider, eqGain5);
    //Ringmod
    Pedales[11] = (PedalElement *)calloc(1, sizeof(PedalElement));
    Pedales[11]->perilla = initPerilla(1);
    Pedales[11]->perilla->perillas[0] = guiDialButton(0, "", 223, 73, 0.179f, 0.045f, PERILLA, &perilla3535, ringmodRate);

    //Inicializo los Push (3pdt) Pantalla 1
    //PEDALES Menu
    Pedales[0]->push = (PushElement *)calloc(1, sizeof(PushElement));
    Pedales[0]->push->push_menu = initPushLink(DELAY, 76, 13 + 110 / 2, 58, 110 / 2, PushCallback, handlePushMenuButton);

    Pedales[1]->push = (PushElement *)calloc(1, sizeof(PushElement));
    Pedales[1]->push->push_menu = initPushLink(OCTAVADOR, 198, 13 + 110 / 2, 84, 110 / 2, PushCallback, handlePushMenuButton);

    Pedales[2]->push = (PushElement *)calloc(1, sizeof(PushElement));
    Pedales[2]->push->push_menu = initPushLink(CHORUS, 346, 13 + 110 / 2, 61, 110 / 2, PushCallback, handlePushMenuButton);

    Pedales[3]->push = (PushElement *)calloc(1, sizeof(PushElement));
    Pedales[3]->push->push_menu = initPushLink(PHASER, 73, 149 + 110 / 2, 64, 110 / 2, PushCallback, handlePushMenuButton);

    Pedales[4]->push = (PushElement *)calloc(1, sizeof(PushElement));
    Pedales[4]->push->push_menu = initPushLink(WAH, 190, 160 + 88 / 2, 100, 88 / 2, PushCallback, handlePushMenuButton);

    Pedales[5]->push = (PushElement *)calloc(1, sizeof(PushElement));
    Pedales[5]->push->push_menu = initPushLink(REVERB, 343, 149 + 110 / 2, 67, 110 / 2, PushCallback, handlePushMenuButton);

    //Inicializo los Push (3pdt) Pantalla2
    //PEDALES Menu
    Pedales[6]->push = (PushElement *)calloc(1, sizeof(PushElement));
    Pedales[6]->push->push_menu = initPushLink(DISTORSION, 70, 13 + 110 / 2, 59, 110 / 2, PushCallback, handlePushMenuButton);

    Pedales[7]->push = (PushElement *)calloc(1, sizeof(PushElement));
    Pedales[7]->push->push_menu = initPushLink(FLANGER, 179, 23 + 90 / 2, 121, 90 / 2, PushCallback, handlePushMenuButton);

    Pedales[8]->push = (PushElement *)calloc(1, sizeof(PushElement));
    Pedales[8]->push->push_menu = initPushLink(TREMOLO, 354, 13 + 110 / 2, 80, 110 / 2, PushCallback, handlePushMenuButton);

    Pedales[9]->push = (PushElement *)calloc(1, sizeof(PushElement));
    Pedales[9]->push->push_menu = initPushLink(VIBRATO, 71, 149 + 110 / 2, 57, 110 / 2, PushCallback, handlePushMenuButton);

    Pedales[10]->push = (PushElement *)calloc(1, sizeof(PushElement));
    Pedales[10]->push->push_menu = initPushLink(EQ, 181, 159 + 90 / 2, 118, 90 / 2, PushCallback, handlePushMenuButton);

    Pedales[11]->push = (PushElement *)calloc(1, sizeof(PushElement));
    Pedales[11]->push->push_menu = initPushLink(RINGMOD, 360, 149 + 110 / 2, 68, 110 / 2, PushCallback, handlePushMenuButton);

    //Inicializo los Push (3pdt) Pantalla2
    //PEDALES Menu
    Pedales[12]->push = (PushElement *)calloc(1, sizeof(PushElement));
    Pedales[12]->push->push_menu = initPushLink(GRABAR, 100, 91, 280, 90, PushCallback, handlePushMenuButton);

    //PEDALES Individuales Pantalla1
    Pedales[0]->push->push_indiv = initPushLink(DELAY, 225, 189, 31, 33, PushCallback, handlePushIndividualButton);
    Pedales[1]->push->push_indiv = initPushLink(OCTAVADOR, 219, 180, 42, 42, PushCallback, handlePushIndividualButton);
    Pedales[2]->push->push_indiv = initPushLink(CHORUS, 180, 163, 117, 77, PushCallback, handlePushIndividualButton);
    Pedales[3]->push->push_indiv = initPushLink(PHASER, 222, 171, 37, 37, PushCallback, handlePushIndividualButton);
    Pedales[4]->push->push_indiv = initPushLink(WAH, 218, 213, 41, 41, PushCallback, handlePushIndividualButton);
    Pedales[5]->push->push_indiv = initPushLink(REVERB, 180, 163, 117, 77, PushCallback, handlePushIndividualButton);

    //PEDALES Individuales Pantalla2
    Pedales[6]->push->push_indiv = initPushLink(DISTORSION, 223, 184, 35, 35, PushCallback, handlePushIndividualButton);
    Pedales[7]->push->push_indiv = initPushLink(FLANGER, 223, 168, 37, 37, PushCallback, handlePushIndividualButton);
    Pedales[8]->push->push_indiv = initPushLink(TREMOLO, 222, 203, 36, 36, PushCallback, handlePushIndividualButton);
    Pedales[9]->push->push_indiv = initPushLink(VIBRATO, 221, 188, 37, 37, PushCallback, handlePushIndividualButton);
    Pedales[10]->push->push_indiv = initPushLink(EQ, 218, 186, 37, 41, PushCallback, handlePushIndividualButton);
    Pedales[11]->push->push_indiv = initPushLink(RINGMOD, 223, 210, 35, 34, PushCallback, handlePushIndividualButton);
    //PEDALES estados
    Pedales[0]->push->push_state = GUI_OFF;
    Pedales[1]->push->push_state = GUI_OFF;
    Pedales[2]->push->push_state = GUI_OFF;
    Pedales[3]->push->push_state = GUI_OFF;
    Pedales[4]->push->push_state = GUI_OFF;
    Pedales[5]->push->push_state = GUI_OFF;
    Pedales[6]->push->push_state = GUI_OFF;
    Pedales[7]->push->push_state = GUI_OFF;
    Pedales[8]->push->push_state = GUI_OFF;
    Pedales[9]->push->push_state = GUI_OFF;
    Pedales[10]->push->push_state = GUI_OFF;
    Pedales[11]->push->push_state = GUI_OFF;

    Pedales[12]->push->push_state = GUI_OFF;

    //Inicializo los links de los pedales Pantalla1
    Pedales[0]->link = (LinkElement *)calloc(1, sizeof(LinkElement));
    Pedales[0]->link = initPushLink(DELAY, 76, 13, 58, 110 / 2, LinkCallback, handleLinkButton);

    Pedales[1]->link = (LinkElement *)calloc(1, sizeof(LinkElement));
    Pedales[1]->link = initPushLink(OCTAVADOR, 198, 13, 84, 110 / 2, LinkCallback, handleLinkButton);

    Pedales[2]->link = (LinkElement *)calloc(1, sizeof(LinkElement));
    Pedales[2]->link = initPushLink(CHORUS, 346, 13, 61, 110 / 2, LinkCallback, handleLinkButton);

    Pedales[3]->link = (LinkElement *)calloc(1, sizeof(LinkElement));
    Pedales[3]->link = initPushLink(PHASER, 73, 149, 64, 110 / 2, LinkCallback, handleLinkButton);

    Pedales[4]->link = (LinkElement *)calloc(1, sizeof(LinkElement));
    Pedales[4]->link = initPushLink(WAH, 190, 160, 100, 88 / 2, LinkCallback, handleLinkButton);

    Pedales[5]->link = (LinkElement *)calloc(1, sizeof(LinkElement));
    Pedales[5]->link = initPushLink(REVERB, 343, 149, 67, 110 / 2, LinkCallback, handleLinkButton);

    //Inicializo los links de los pedales Pantalla2
    Pedales[6]->link = (LinkElement *)calloc(1, sizeof(LinkElement));
    Pedales[6]->link = initPushLink(DISTORSION, 70, 13, 59, 110 / 2, LinkCallback, handleLinkButton);

    Pedales[7]->link = (LinkElement *)calloc(1, sizeof(LinkElement));
    Pedales[7]->link = initPushLink(FLANGER, 179, 23, 121, 90 / 2, LinkCallback, handleLinkButton);

    Pedales[8]->link = (LinkElement *)calloc(1, sizeof(LinkElement));
    Pedales[8]->link = initPushLink(TREMOLO, 354, 13, 80, 110 / 2, LinkCallback, handleLinkButton);

    Pedales[9]->link = (LinkElement *)calloc(1, sizeof(LinkElement));
    Pedales[9]->link = initPushLink(VIBRATO, 71, 149, 57, 110 / 2, LinkCallback, handleLinkButton);

    Pedales[10]->link = (LinkElement *)calloc(1, sizeof(LinkElement));
    Pedales[10]->link = initPushLink(EQ, 181, 159, 118, 90 / 2, LinkCallback, handleLinkButton);

    Pedales[11]->link = (LinkElement *)calloc(1, sizeof(LinkElement));
    Pedales[11]->link = initPushLink(RINGMOD, 360, 149, 68, 110 / 2, LinkCallback, handleLinkButton);

    //Inicializo los botones de las pantallas individuales de los pedales PANTALLA1
    Pedales[0]->botones = (MenuElement *)calloc(1, sizeof(MenuElement));
    Pedales[0]->botones->flecha_derecha = initPushLink(DERECHA, 417, 84, 61, 107, LinkDerechaCallbackPedal, handleDerechaButtonPedal);
    Pedales[0]->botones->flecha_izquierda = initPushLink(IZQUIERDA, 0, 84, 61, 107, LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
    Pedales[0]->botones->home = initPushLink(HOME, 0, 0, 70, 70, LinkHomeCallbackPedal, handleHomeButtonPedal);

    Pedales[1]->botones = (MenuElement *)calloc(1, sizeof(MenuElement));
    Pedales[1]->botones->flecha_derecha = initPushLink(DERECHA, 417, 84, 61, 107, LinkDerechaCallbackPedal, handleDerechaButtonPedal);
    Pedales[1]->botones->flecha_izquierda = initPushLink(IZQUIERDA, 0, 84, 61, 107, LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
    Pedales[1]->botones->home = initPushLink(HOME, 0, 0, 70, 70, LinkHomeCallbackPedal, handleHomeButtonPedal);

    Pedales[2]->botones = (MenuElement *)calloc(1, sizeof(MenuElement));
    Pedales[2]->botones->flecha_derecha = initPushLink(DERECHA, 417, 84, 61, 107, LinkDerechaCallbackPedal, handleDerechaButtonPedal);
    Pedales[2]->botones->flecha_izquierda = initPushLink(IZQUIERDA, 0, 84, 61, 107, LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
    Pedales[2]->botones->home = initPushLink(HOME, 0, 0, 70, 70, LinkHomeCallbackPedal, handleHomeButtonPedal);

    Pedales[3]->botones = (MenuElement *)calloc(1, sizeof(MenuElement));
    Pedales[3]->botones->flecha_derecha = initPushLink(DERECHA, 417, 84, 61, 107, LinkDerechaCallbackPedal, handleDerechaButtonPedal);
    Pedales[3]->botones->flecha_izquierda = initPushLink(IZQUIERDA, 0, 84, 61, 107, LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
    Pedales[3]->botones->home = initPushLink(HOME, 0, 0, 70, 70, LinkHomeCallbackPedal, handleHomeButtonPedal);

    Pedales[4]->botones = (MenuElement *)calloc(1, sizeof(MenuElement));
    Pedales[4]->botones->flecha_derecha = initPushLink(DERECHA, 417, 84, 61, 107, LinkDerechaCallbackPedal, handleDerechaButtonPedal);
    Pedales[4]->botones->flecha_izquierda = initPushLink(IZQUIERDA, 0, 84, 61, 107, LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
    Pedales[4]->botones->home = initPushLink(HOME, 0, 0, 70, 70, LinkHomeCallbackPedal, handleHomeButtonPedal);

