codewarlocks/stm32f7-Pedalboard/Projects/STM32746G-Discovery/Examples/BSP/MDK-ARM/STM32746G_DISCOVERY/Example/User/gui.c
    Pedales[5]->botones = (MenuElement *)calloc(1, sizeof(MenuElement));
    Pedales[5]->botones->flecha_derecha = initPushLink(DERECHA, 417, 84, 61, 107, LinkDerechaCallbackPedal, handleDerechaButtonPedal);
    Pedales[5]->botones->flecha_izquierda = initPushLink(IZQUIERDA, 0, 84, 61, 107, LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
    Pedales[5]->botones->home = initPushLink(HOME, 0, 0, 70, 70, LinkHomeCallbackPedal, handleHomeButtonPedal);

    //Inicializo los botones de las pantallas individuales de los pedales PANTALLA2
    Pedales[6]->botones = (MenuElement *)calloc(1, sizeof(MenuElement));
    Pedales[6]->botones->flecha_derecha = initPushLink(DERECHA, 417, 84, 61, 107, LinkDerechaCallbackPedal, handleDerechaButtonPedal);
    Pedales[6]->botones->flecha_izquierda = initPushLink(IZQUIERDA, 0, 84, 61, 107, LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
    Pedales[6]->botones->home = initPushLink(HOME, 0, 0, 70, 70, LinkHomeCallbackPedal, handleHomeButtonPedal);

    Pedales[7]->botones = (MenuElement *)calloc(1, sizeof(MenuElement));
    Pedales[7]->botones->flecha_derecha = initPushLink(DERECHA, 417, 84, 61, 107, LinkDerechaCallbackPedal, handleDerechaButtonPedal);
    Pedales[7]->botones->flecha_izquierda = initPushLink(IZQUIERDA, 0, 84, 61, 107, LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
    Pedales[7]->botones->home = initPushLink(HOME, 0, 0, 70, 70, LinkHomeCallbackPedal, handleHomeButtonPedal);

    Pedales[8]->botones = (MenuElement *)calloc(1, sizeof(MenuElement));
    Pedales[8]->botones->flecha_derecha = initPushLink(DERECHA, 417, 84, 61, 107, LinkDerechaCallbackPedal, handleDerechaButtonPedal);
    Pedales[8]->botones->flecha_izquierda = initPushLink(IZQUIERDA, 0, 84, 61, 107, LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
    Pedales[8]->botones->home = initPushLink(HOME, 0, 0, 70, 70, LinkHomeCallbackPedal, handleHomeButtonPedal);

    Pedales[9]->botones = (MenuElement *)calloc(1, sizeof(MenuElement));
    Pedales[9]->botones->flecha_derecha = initPushLink(DERECHA, 417, 84, 61, 107, LinkDerechaCallbackPedal, handleDerechaButtonPedal);
    Pedales[9]->botones->flecha_izquierda = initPushLink(IZQUIERDA, 0, 84, 61, 107, LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
    Pedales[9]->botones->home = initPushLink(HOME, 0, 0, 70, 70, LinkHomeCallbackPedal, handleHomeButtonPedal);

    Pedales[10]->botones = (MenuElement *)calloc(1, sizeof(MenuElement));
    Pedales[10]->botones->flecha_derecha = initPushLink(DERECHA, 417, 84, 61, 107, LinkDerechaCallbackPedal, handleDerechaButtonPedal);
    Pedales[10]->botones->flecha_izquierda = initPushLink(IZQUIERDA, 0, 84, 61, 107, LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
    Pedales[10]->botones->home = initPushLink(HOME, 0, 0, 70, 70, LinkHomeCallbackPedal, handleHomeButtonPedal);

    Pedales[11]->botones = (MenuElement *)calloc(1, sizeof(MenuElement));
    Pedales[11]->botones->flecha_derecha = initPushLink(DERECHA, 417, 84, 61, 107, LinkDerechaCallbackPedal, handleDerechaButtonPedal);
    Pedales[11]->botones->flecha_izquierda = initPushLink(IZQUIERDA, 0, 84, 61, 107, LinkIzquierdaCallbackPedal, handleIzquierdaButtonPedal);
    Pedales[11]->botones->home = initPushLink(HOME, 0, 0, 70, 70, LinkHomeCallbackPedal, handleHomeButtonPedal);

    //Link Menu Izq y Der
    Flecha_Menu_Izquierda = (LinkElementMenu *)calloc(1, sizeof(LinkElementMenu));
    Flecha_Menu_Izquierda = initPushLinkMenu(IZQUIERDA_MENU, 5, 101, 39, 70, LinkIzquierdaCallbackMenu, handleIzquierdaButtonMenu);
    Flecha_Menu_Derecha = (LinkElementMenu *)calloc(1, sizeof(LinkElementMenu));
    Flecha_Menu_Derecha = initPushLinkMenu(DERECHA_MENU, 435, 101, 39, 70, LinkDerechaCallbackMenu, handleDerechaButtonMenu);
                #endif /* if SCREEN_ENABLE */

    //Inicializo los pedales con sus funciones PANTALLA1
    Pedales[0]->efecto = delayEfecto;
    Pedales[1]->efecto = octavadorEfecto;
    Pedales[2]->efecto = chorusEfecto;
    Pedales[3]->efecto = phaserEfecto;
    Pedales[4]->efecto = autowahEfecto;
    Pedales[5]->efecto = reverbEfecto;

    //Inicializo los pedales con sus funciones PANTALLA2
    Pedales[6]->efecto = distorsionEfecto;
    Pedales[7]->efecto = flangerEfecto;
    Pedales[8]->efecto = tremoloEfecto;
    Pedales[9]->efecto = vibratoEfecto;
    Pedales[10]->efecto = eqEfecto;
    Pedales[11]->efecto = ringmodEfecto;

    //Inicializo los pedales con sus funciones PANTALLA3
    Pedales[12]->efecto = grabar_wav;
}
